_global.translation['ja'] = {

    //HTMLCSAuditor.js
    "auditor_name" : 'HTML_CodeSniffer'
    ,"auditor_using_standard" : 'Using standard'
    ,"auditor_standards" : '適合レベル'
    ,"auditor_code_snippet" : 'コードスニペット'
    ,"auditor_close" : '閉じる'
    ,"auditor_select_types" : 'レポートに含める報告の種類を選択してください'
    ,"auditor_home" : 'ホーム'
    ,"auditor_view_report" : 'レポートをみる'
    ,"auditor_report" : 'レポート'
    ,"auditor_back_to_report" : 'レポートに戻る'
    ,"auditor_previous_issue" : '前の報告'
    ,"auditor_next_issue" : '次の報告'
    ,"auditor_issue" : '報告'
    ,"auditor_of" : '/'
    ,"auditor_errors" : 'エラー'
    ,"auditor_error" : 'エラー'
    ,"auditor_warnings" : '警告'
    ,"auditor_warning" : '警告'
    ,"auditor_notices" : '通知'
    ,"auditor_notice" : '通知'
    ,"auditor_toggle_display_of" : 'Toggle display of'
    ,"auditor_messages" : 'メッセージ'
    ,"auditor_unable_to_point" : 'この報告に関係する要素の位置を特定できません。'
    ,"auditor_unable_to_point_entire" : 'この報告はドキュメント全体に関係するため、問題の位置を特定できません。'
    ,"auditor_unable_to_point_removed" : 'この要素はレポート作成後に削除されたため、要素の位置を特定できません。'
    ,"auditor_unable_to_point_outside" : 'この要素はドキュメントボディの外に位置するため、要素の位置を特定できません。'
    ,"auditor_unable_to_point_hidden" : 'この要素はビューから隠れているか、視覚表現をもたないため、要素の位置を特定できません。'
    ,"auditor_point_to_element" : '要素の位置を特定'
    ,"auditor_unsupported_browser" : 'このコードスニペットの機能は、このブラウザでサポートされていません。'
    ,"auditor_page" : 'ページ'
    ,"auditor_updated_to" : 'HTML_CodeSniffer のバージョンがアップデートされました'
    ,"auditor_view_the_changelog" : '更新履歴をみる'
    ,"auditor_success_criterion" : "成功基準"
    ,"auditor_suggested_techniques" : "推奨される手法"
    ,"auditor_applies_entire_document" : "これはドキュメント全体に適用されます"

    //1_1_1.js
    ,"1_1_1_H30.2" : 'img 要素がこのリンクの唯一のコンテンツですが、 alt テキストがありません。 alt テキストがリンクの目的を説明するべきです。'
    ,"1_1_1_H67.1" : '空の alt テキストをもつ img 要素は title 属性をもたないか、または、空でなければなりません。'
    ,"1_1_1_H67.2" : 'img 要素は支援技術に無視されるようマークアップされています。'
    ,"1_1_1_H37" : 'Img 要素に alt 属性が不足しています。 alt 属性で短い代替テキストを明示してください。'
    ,"1_1_1_G94.Image" : 'img 要素 の alt テキストが、この画像と同じ目的や情報を提供していることを確認してください。'
    ,"1_1_1_H36" : '画像による送信ボタンに alt 属性が不足しています。このボタンの機能を説明する代替テキストを alt 属性で明示してください。'
    ,"1_1_1_G94.Button" : '画像による送信ボタンの代替テキストがそのボタンの目的を特定していることを確認してください。'
    ,"1_1_1_H24" : 'イメージマップのArea 要素に alt 属性が不足しています。各 area 要素は、そのイメージマップエリアの機能を説明する代替テキストを持たなければなりません。'
    ,"1_1_1_H24.2" : 'area 要素の代替テキストが、参照するイメージマップ画像の部分と同じ目的を提供していることを確認してください。'
    ,"1_1_1_G73,G74" : 'もし短い代替テキストでこのイメージが十分に説明できないなら、ボディテキストやリンクなどを通じて長い代替テキストを提供してください。'
    ,"1_1_1_H2.EG5" : 'リンク内の img 要素は 代替テキストにリンクのコンテンツのテキストの複製を使用してはなりません。'
    ,"1_1_1_H2.EG4" : 'テキストリンクと隣り合うリンク内の img 要素の alt 属性が指定されていないか空になっています。テキストと画像のリンクを一つにまとめることを検討してください。'
    ,"1_1_1_H2.EG3" : 'テキストリンクと隣り合うリンク内の img 要素の alt 属性にテキストリンクの内容の複製を使用してはいけません。'
    ,"1_1_1_H53,ARIA6" : '他のすべての選択肢が尽きた後は、 object 要素に代替テキストを含める必要があります。'
    ,"1_1_1_G94,G92.Object,ARIA6" : '短い（適切な場合は長い）代替テキストが、同じ目的を果たし同じ情報を提示する非テキストコンテンツに対して提供されていることを確認してください。'
    ,"1_1_1_H35.3" : 'applet 要素をサポートしていないブラウザでは、 applet 要素の要素本文に代替テキストを含める必要があります。'
    ,"1_1_1_H35.2" : 'applet 要素をサポートしているがロードできないブラウザに対して代替テキストを提供するために、 applet 要素は alt 属性を含まなければなりません。'
    ,"1_1_1_G94,G92.Applet" : '非テキストコンテンツに対して、同じ目的を果たし、かつ同じ情報を示す短い（適切な場合は長い）代替テキストが提供されていることを確認してください。'


    //1_2_1.js
    ,"1_2_1_G158" : 'この埋め込みオブジェクトに録音済みの音声のみが含まれていて、テキストコンテンツの代替として提供されていない場合は、代替テキストバージョンが利用可能であることを確認してください。'
    ,"1_2_1_G159,G166" : 'この埋め込みオブジェクトに録画済みの映像のみが含まれており、テキストコンテンツの代替として提供されていない場合は、代替テキストバージョンが利用可能であるか、同等の情報を示す音声トラックが提供されていることを確認してください。'


    //1_2_2.js
    ,"1_2_2_G87,G93" : 'この埋め込みオブジェクトに事前に記録された同期したメディアが含まれており、テキストコンテンツの代替として提供されていない場合は、音声コンテンツ用のキャプションが提供されていることを確認してください'


    //1_2_3.js
    ,"1_2_3_G69,G78,G173,G8" : 'この埋め込みオブジェクトに事前に記録された同期したメディアが含まれていて、テキストコンテンツの代替として提供されていない場合は、その映像の音声説明および/またはコンテンツの代替テキストバージョンが提供されていることを確認してください。'


    //1_2_4.js
    ,"1_2_4_G9,G87,G93" : 'この埋め込みオブジェクトに同期したメディアが含まれている場合は、ライブの音声コンテンツにキャプションが提供されていることを確認してください。'


    //1_2_5.js
    ,"1_2_5_G78,G173,G8" : 'この埋め込みオブジェクトに事前に記録された同期したメディアが含まれている場合は、その映像コンテンツに音声の説明があることを確認してください。'


    //1_2_6.js
    ,"1_2_6_G54,G81" : 'この埋め込みオブジェクトに記録済みの同期したメディアが含まれている場合は、その音声に手話の解釈が提供されていることを確認してください。'


    //1_2_7.js
    ,"1_2_7_G8" : 'この埋め込みオブジェクトに同期したメディアが含まれていて、前景音の一時停止による音声解説が収録済映像の意味を伝えるのに不十分な場合、スクリプトまたは代替バージョンで拡張音声解説が提供させていることを確認してください。'


    //1_2_8.js
    ,"1_2_8_G69,G159" : 'この埋め込みオブジェクトに事前に記録された同期したメディアまたは映像のみのコンテンツが含まれている場合は、コンテンツの代替テキストバージョンが提供されていることを確認してください。'


    //1_2_9.js
    ,"1_2_9_G150,G151,G157" : 'この埋め込みオブジェクトにライブの音声のみのコンテンツが含まれている場合は、そのコンテンツの代替テキストバージョンが提供されていることを確認してください。'


    //1_3_1.js
    ,"1_3_1_F92,ARIA4" : 'この要素の役割は"プレゼンテーション"ですが、セマンティックな意味を持つ子要素を含みます。'
    ,"1_3_1_H44.NonExistent" : 'このラベルの "for" 属性に、ドキュメントに存在しない ID が含まれています。'
    ,"1_3_1_H44.NonExistentFragment" : 'このラベルの "for" 属性に、ドキュメントフラグメントに存在しない ID が含まれています。'
    ,"1_3_1_H44.NotFormControl" : 'このラベルの "for" 属性には、フォームコントロールでない要素の ID が含まれています。目的の要素に正しい ID を入力していることを確認してください。'
    ,"1_3_1_H65" : 'このフォームコントロールには、空またはスペースのみを含む "title" 属性があります。ラベリングテストの目的では無視されます。'
    ,"1_3_1_ARIA6" : 'このフォームコントロールには、空またはスペースのみを含む "aria-label" 属性があります。ラベリングテストの目的では無視されます。'
    //{{id}} will be replace with element ID:
    ,"1_3_1_ARIA16,ARIA9" : 'このフォームコントロールには aria-labelledby 属性が含まれていますが、要素には存在しないID "{{id}}" が含まれています。 aria-labelledby 属性はラベリングテストの目的では無視されます。'

    ,"1_3_1_F68.Hidden" : 'この hidden のフォームフィールドには何らかの方法でラベルが付けられています。 hidden のフォームフィールドにラベルを付ける必要はありません。'
    ,"1_3_1_F68.HiddenAttr" : 'このフォームフィールドは（ "hidden" 属性を使用して）非表示にすることを目的としていますが、何らかの方法でラベル付けされています。隠しフォームフィールドにラベルを付ける必要はありません。'
    ,"1_3_1_F68" : 'このフォームフィールドは何らかの方法でラベル付けされるべきです。 label 要素（ "for" 属性を持つかフォームフィールドを囲む）、または "title"、 "aria-label" 、または "aria-labelledby" 属性を適切に使用してください。'

    ,"1_3_1_H49." : 'HTML5では時代遅れになっているプレゼンテーションマークアップが使用されています。'
    ,"1_3_1_H49.AlignAttr" : '属性を揃えます'
    ,"1_3_1_H49.Semantic" : '強調テキストまたは特殊テキストには、プログラム的に決定できるようセマンティックマークアップが使用されるべきです。'
    ,"1_3_1_H49.AlignAttr.Semantic" : '強調テキストまたは特殊テキストには、プログラム的に決定できるようセマンティックマークアップが使用されるべきです。'

    ,"1_3_1_H42" : 'このコンテンツが見出しとして意図されている場合は、見出しマークアップを使用する必要があります。'

    ,"1_3_1_H63.3" : 'テーブルセルに無効な scope 属性があります。有効な値は、 row 、 col 、 rowgroup 、または colgroup です。'
    ,"1_3_1_H63.2" : '他の要素の見出しとして機能する td 要素のスコープ属性は、HTML5では廃止されました。代わりに th 要素を使用してください。'
    ,"1_3_1_H43.ScopeAmbiguous" : '複数のレベルの見出しを持つテーブルでは、 th 要素のスコープ属性はあいまいです。代わりに td 要素の headers 属性を使用してください。'
    ,"1_3_1_H43.IncorrectAttr" : 'この td 要素のヘッダー属性が正しくありません。 "{{expected}}" を予期していましたが、 "{{actual}}" を検出しました'

    ,"1_3_1_H43.HeadersRequired" : 'td 要素とそれに関連する th 要素の関係は定義されていません。このテーブルには複数レベルの th 要素があるため、 td 要素には headers 属性を使用する必要があります。'
    ,"1_3_1_H43.MissingHeaderIds" : 'このテーブルに id 属性を含まない th 要素があります。これらのセルは、それらが td 要素の headers 属性によって参照されるように ID を含むべきです。'
    ,"1_3_1_H43.MissingHeadersAttrs" : 'このテーブルに headers 属性を含まない td 要素があります。各 headers 属性は、そのセルに関連付けられているすべての th 要素の ID を列挙する必要があります。'
    ,"1_3_1_H43,H63" : 'td 要素とそれに関連する th 要素の関係は定義されていません。 th 要素に scope 属性を使用するか、td 要素に headers 属性を使用してください。'
    ,"1_3_1_H63.1" : 'このテーブルに scope 属性をもたない th 要素があります。これらのセルは、 td 要素との関連を識別するための scope 属性を含むべきです。'

    ,"1_3_1_H73.3.LayoutTable" : 'このテーブルはレイアウトに使用されているように見えますが、 summary 属性が含まれています。レイアウトテーブルに summary 属性を含めないか、または、指定されている場合は空にしてください。'
    ,"1_3_1_H39,H73.4" : 'このテーブルがデータテーブルで、 summary 属性と caption 要素の両方が存在する場合、 summary は caption を複製しないでください。'
    ,"1_3_1_H73.3.Check" : 'このテーブルがデータテーブルである場合は、 summary 属性がテーブルの構成を説明していること、またはテーブルの使用方法を説明していることを確認してください。'
    ,"1_3_1_H73.3.NoSummary" : 'このテーブルがデータテーブルの場合は、 table 要素の summary 属性を使用してこのテーブルの概要を説明してください。'
    ,"1_3_1_H39.3.LayoutTable" : 'このテーブルはレイアウトに使用されているように見えますが、 caption 要素が含まれています。レイアウトテーブルに caption を含めることはできません。'
    ,"1_3_1_H39.3.Check" : 'このテーブルがデータテーブルの場合は、 caption 要素がこのテーブルを正確に記述していることを確認してください。'
    ,"1_3_1_H39.3.NoCaption" : 'このテーブルがデータテーブルである場合は、このテーブルを識別するために table 要素に caption 要素を使用することを検討してください。'

    ,"1_3_1_H71.NoLegend" : 'フィールドセットに legend 要素が含まれていません。すべてのフィールドセットには、フィールドグループの説明を記述する legend 要素を含める必要があります。'
    ,"1_3_1_H85.2" : 'この選択リストに関連オプションのグループが含まれている場合は、それらを optgroup とグループ化する必要があります。'

    ,"1_3_1_H71.SameName" : 'これらのラジオボタンまたはチェックボックスにさらにグループレベルの説明が必要な場合は、それらを fieldset 要素に含める必要があります。'

    ,"1_3_1_H48.1" : 'このコンテンツは、プレーンテキストを使用して番号なしリストをシミュレートしているように見えます。もしそうなら、 ul 要素でこの内容をマークアップすることで文書に適切な構造情報を追加します。'
    ,"1_3_1_H48.2" : 'このコンテンツは、プレーンテキストを使用して番号付きリストをシミュレートしているように見えます。もしそうなら、 ol 要素でこの内容をマークアップすることで文書に適切な構造情報を追加します。'

    ,"1_3_1_G141_a" : '見出し構造が論理的にネストされていません。この h{{headingNum}} 要素は主な文書見出しであるようにみえるため、 h1 要素であるべきです。'
    ,"1_3_1_G141_b" : '見出し構造が論理的にネストされていません。適切にネストするには、この h{{headingNum}} 要素を h{{properHeadingNum}} にする必要があります。'

    ,"1_3_1_H42.2" : '見出しタグがコンテンツなしで見つかりました。見出しとして意図されていないテキストは、見出しタグでマークアップしてはいけません。'
    ,"1_3_1_H48" : 'この要素にナビゲーションセクションが含まれる場合は、リストとしてマークアップすることを推奨します。'

    ,"1_3_1_LayoutTable" : 'このテーブルはレイアウトテーブルのようにみえます。もしデータテーブルであることを意図している場合、 th 要素を使用することでヘッダーセルが識別されるようにしてください。'
    ,"1_3_1_DataTable" : 'このテーブルはデータテーブルのようにみえます。もしレイアウトテーブルであることを意図している場合は、 th 要素がないこと、および summary または caption がないことを確認してください。'


    //1_3_2.js
    ,"1_3_2_G57" : 'スタイルシートが無効になっている場合など、線形化されたときにコンテンツが意味のある順序で並べられていることを確認してください。'


    //1_3_3.js
    ,"1_3_3_G96" : 'コンテンツを理解するための説明が提供されている場合は、オブジェクトを説明するために（形状、サイズ、場所などの）感覚的な特性だけに頼らないでください。'


    //1_4_1.js
    ,"1_4_1_G14,G18" : '色だけを使って伝えられる情報がテキストや他の視覚的な手がかりを通しても利用可能であることを確認してください。'


    //1_4_2.js
    ,"1_4_2_F23" : 'この要素に3秒を超えて自動再生される音声が含まれている場合は、音声を一時停止、停止、またはミュートする機能があることを確認してください。'


    //1_4_3_F24.js
    ,"1_4_3_F24.BGColour" : 'この要素に継承された前景色があり、対応するインラインの背景色または画像を引き立てていることを確認してください。'
    ,"1_4_3_F24.FGColour" : 'この要素に継承された背景色または画像があり、対応するインラインの前景色を引き立てていることを確認してください。'


    //1_4_3.js
    ,"1_4_3_G18_or_G145.Abs" : 'この要素は絶対位置に配置されているため、背景色を決定できません。テキストと背景の覆われた部分すべてのコントラスト比が少なくとも{{required}}:1であることを確認してください。'
    ,"1_4_3_G18_or_G145.BgImage" : 'この要素のテキストは背景画像に配置されます。テキストと画像の覆われている部分すべてのコントラスト比が少なくとも{{required}}:1であることを確認してください。'
    ,"1_4_3_G18_or_G145.Alpha" : 'この要素のテキストまたは背景は透明部分を含みます。テキストと背景のコントラスト比が少なくとも{{required}}:1であることを確認してください。'
    ,"1_4_3_G18_or_G145.Fail" : 'この要素は、この適合レベルではコントラストが不十分です。少なくとも{{required}}:1のコントラスト比が必要ですが、この要素のテキストのコントラスト比は{{value}}:1です。'
    ,"1_4_3_G18_or_G145.Fail.Recomendation" : '推奨: '
    ,"1_4_3_G18_or_G145.Fail.Recomendation.Text" : '文字色を{{value}}に変更する'
    ,"1_4_3_G18_or_G145.Fail.Recomendation.Background" : '背景を{{value}}に変更する'


    //1_4_4.js
    ,"1_4_4_G142" : 'コンテンツや機能を損なうことなく、支援技術なしでテキストを200パーセントまでリサイズできることを確認してください。'


    //1_4_5.js
    ,"1_4_5_G140,C22,C30.AALevel" : '使用している技術で意図した視覚的提示が可能である場合、文字画像ではなくテキストが情報伝達に用いられているか確認してください。ただし、文字画像が、伝えようとする情報にとって必要不可欠であるか、または、利用者の要求に応じて視覚的にカスタマイズできる場合を除きます。'


    //1_4_6.js
    ,"1_4_6_G18_or_G17.Abs" : 'この要素は絶対位置に配置されているため、背景色を決定できません。テキストと背景の覆われた部分すべてのコントラスト比が少なくとも{{required}}:1であることを確認してください。'
    ,"1_4_6_G18_or_G17.BgImage" : 'この要素のテキストは背景画像に配置されます。テキストと画像の覆われている部分すべてのコントラスト比が少なくとも{{required}}:1であることを確認してください。'
    ,"1_4_6_G18_or_G17.Fail" : 'この要素は、この適合レベルではコントラストが不十分です。少なくとも{{required}}:1のコントラスト比が必要ですが、この要素のテキストのコントラスト比は{{value}}:1です。'
    ,"1_4_6_G18_or_G17.Fail.Recomendation" : '推奨: '
    ,"1_4_6_G18_or_G17.Fail.Recomendation.Text" : '文字色を{{value}}に変更する'
    ,"1_4_6_G18_or_G17.Fail.Recomendation.Background" : '背景を{{value}}に変更する'



    //1_4_7.js
    ,"1_4_7_G56" : '主に（ナレーションなどの）スピーチである要素内の事前録音された音声のみのコンテンツでは、背景音はミュート可能であるか、またはスピーチより少なくとも20dB（または約4倍）静かである必要があります。'


    //1_4_8.js
    ,"1_4_8_G148,G156,G175" : 'ウェブページまたはブラウザを介して、ユーザーがテキストブロックの前景色と背景色を選択できるメカニズムがあることを確認してください。'
    ,"1_4_8_H87,C20" : 'テキストブロックの幅を80文字以下（中国語、日本語、または韓国語のスクリプトでは40文字以下）に縮小するメカニズムが存在することを確認してください。'
    ,"1_4_8_C19,G172,G169" : 'テキストブロックが両端揃えされていないこと、または両端揃えを削除するためのメカニズムが存在することを確認してください。'
    ,"1_4_8_G188,C21" : 'テキストブロック内の行間隔が段落内で少なくとも150％であり、段落間隔が行間隔の少なくとも1.5倍であること、またはこれを達成するためのメカニズムが使用可能であることを確認してください。'
    ,"1_4_8_H87,G146,C26" : 'ユーザーがフルスクリーンウィンドウ上で水平にスクロールすることを必要とせずに、支援技術なしでテキストを200パーセントまでリサイズできることを確認してください。'


    //1_4_9.js
    ,"1_4_9_G140,C22,C30.NoException" : 'テキストのイメージが純粋な装飾のためか、または、伝えられる情報にテキストの特定の表現が不可欠である場合にだけ使われているか確認してください。'


    //2_1_1.js
    ,"2_1_1_G90" : 'この要素のイベントハンドラによって提供される機能がキーボードから利用可能であることを確認してください。'
    ,"2_1_1_SCR20.DblClick" : 'この要素をダブルクリックすることで提供される機能がキーボードから利用可能であることを確認してください。'
    ,"2_1_1_SCR20.MouseOver" : 'この要素の上にマウスを置くことで提供される機能がキーボードから利用可能であることを確認してください。たとえば、フォーカスイベントの使用などです。'
    ,"2_1_1_SCR20.MouseOut" : 'この要素からマウスを外すことによって提供される機能がキーボードを通して利用可能であることを確認してください。たとえば、 blur イベントの使用などです。'
    ,"2_1_1_SCR20.MouseMove" : 'この要素上でマウスを動かすことによって提供される機能がキーボードを通して利用可能であることを確認してください。'
    ,"2_1_1_SCR20.MouseDown" : 'この要素をマウスオーバーすることで提供される機能がキーボードから利用可能であることを確認してください。たとえば、 keydown イベントの使用などです。'
    ,"2_1_1_SCR20.MouseUp" : 'この要素にマウスを合わせることで提供される機能がキーボードから利用可能であることを確認してください。たとえば、 keyup イベントの使用などです。'


    //2_1_2.js
    ,"2_1_2_F10" : 'このアプレットまたはプラグインが、キーボードを使用しているときにフォーカスをそれ自体から遠ざける機能を提供することを確認してください。'


    //2_2_1.js
    ,"2_2_1_F40.2" : '別のページにリダイレクトするために使用される Meta リフレッシュタグの制限時間が0ではありません。ユーザーはこの制限時間を制御できません。'
    ,"2_2_1_F41.2" : '現在のページを更新するために meta リフレッシュタグが使用されています。ユーザーはこの更新の制限時間を制御できません。'


    //2_2_2.js
    ,"2_2_2_SCR33,SCR22,G187,G152,G186,G191" : 'コンテンツの一部が5秒より長く移動、スクロール、点滅、または自動更新される場合は、コンテンツを一時停止、停止、非表示にできるメカニズムがあることを確認してください。'
    ,"2_2_2_F4" : 'この点滅している要素を5秒以内に止めることができるメカニズムがあることを確認してください。'
    ,"2_2_2_F47" : 'blink 要素は、点滅情報を5秒以内に停止できるという要件を満たせません。'


    //2_2_3.js
    ,"2_2_3_G5" : 'タイミングがコンテンツによって提示されるイベントまたはアクティビティの重要な部分でないことを確認してください。ただし、インタラクティブでない同期したメディアおよびリアルタイムイベントを除きます。'


    //2_2_4.js
    ,"2_2_4_SCR14" : '緊急時の中断を除いて、すべての中断（コンテンツの更新を含む）がユーザーによって延期または抑制できることを確認してください。'


    //2_2_5.js
    ,"2_2_5_G105,G181" : 'このウェブページが無活動時間制限のある一連のウェブページの一部である場合は、認証されたユーザーが再認証後にデータを失うことなくアクティビティを続行できることを確認してください。'


    //2_3_1.js
    ,"2_3_1_G19,G176" : 'コンテンツのすべてのコンポーネントが、どの1秒間においても3回を超えて点滅していないこと、または点滅している領域のサイズが十分に小さいことを確認してください。'


    //2_3_2.js
    ,"2_3_2_G19" : 'コンテンツのすべてのコンポーネントが、どの1秒間においても3回を超えて点滅していないことを確認してください。'


    //2_4_1.js
    ,"2_4_1_H64.1" : 'iframe 要素には、フレームを識別する空でない title 属性が必要です。'
    ,"2_4_1_H64.2" : 'この要素の title 属性にフレームを識別するテキストが含まれていることを確認してください。'
    ,"2_4_1_G1,G123,G124,H69" : '一般的なナビゲーション要素はすべて迂回できることを確認してください。例えば、スキップリンク、ヘッダ要素、または ARIA ランドマークを使用します。'
    ,"2_4_1_G1,G123,G124.NoSuchID" : 'このリンクはドキュメント内の名前付きアンカー "{{id}}" を指していますが、その名前のアンカーは存在しません。'
    ,"2_4_1_G1,G123,G124.NoSuchIDFragment" : 'このリンクはドキュメント内の名前付きアンカー "{{id}}" を指していますが、テストされたフラグメント内にその名前のアンカーは存在しません。'


    //2_4_2.js
    ,"2_4_2_H25.1.NoHeadEl" : '説明的な title 要素を配置するための head セクションがありません。'
    ,"2_4_2_H25.1.NoTitleEl" : 'head セクションの空でない title 要素を使って、文書にタイトルをつけるべきです。'
    ,"2_4_2_H25.1.EmptyTitle" : 'head セクションの title 要素が空ではありません。'
    ,"2_4_2_H25.2" : 'title 要素が文書を説明していることを確認してください。'


    //2_4_3.js
    ,"2_4_3_H4.2" : 'tabindex が使用されている場合は、 tabindex 属性で指定されたタブ順序がコンテンツ内の関係に従っていることを確認してください。'


    //2_4_4.js
    ,"2_4_4_H77,H78,H79,H80,H81,H33" : 'プログラムで解釈されるリンクのコンテキストまたはその title 属性と組み合わせたときに、リンクテキストからリンクの目的が判断できることを確認してください。'
    ,"2_4_4_H77,H78,H79,H80,H81" : 'プログラムで解釈されるリンクのコンテキストと組み合わせたときに、リンクテキストからリンクの目的が判断できることを確認してください。'


    //2_4_5.js
    ,"2_4_5_G125,G64,G63,G161,G126,G185" : 'このウェブページが一連のプロセスの一部でない場合は、ウェブページ一式の中でこのウェブページを見つける方法が複数あることを確認してください。'


    //2_4_6.js
    ,"2_4_6_G130,G131" : '見出しとラベルがトピックや目的を説明していることを確認してください。'


    //2_4_7.js
    ,"2_4_7_G149,G165,G195,C15,SCR31" : 'キーボードフォーカスのインジケータをユーザーインターフェイス操作子に視覚的に配置できる操作モードが少なくとも1つあることを確認してください。'


    //2_4_8.js
    ,"2_4_8_H59.1" : 'link 要素はドキュメントのヘッドセクションにのみ配置できます。'
    ,"2_4_8_H59.2a" : 'link 要素に、リンクタイプを識別する空でない rel 属性がありません。'
    ,"2_4_8_H59.2b" : 'link 要素に、リンクされているリソースを指す空でない href 属性がありません。'


    //2_4_9.js
    ,"2_4_9_H30" : 'リンクテキストがリンクの目的を説明していることを確認してください。'



    //3_1_1.js
    ,"3_1_1_H57.2" : 'html 要素には、ドキュメントの言語を記述する lang 属性または xml:lang 属性を含める必要があります。'
    ,"3_1_1_H57.3.Lang" : 'document 要素の lang 属性に指定されている言語が整形式ではないようです。'
    ,"3_1_1_H57.3.XmlLang" : 'document 要素の xml:lang 属性に指定されている言語が整形式ではないようです。'


    //3_1_2.js
    ,"3_1_2_H58" : '言語の変更が、要素の lang 属性または xml:lang 属性、あるいはその両方を使用して適切にマークアップされていることを確認してください。'
    ,"3_1_2_H58.1.Lang" : 'この要素の lang 属性に指定されている言語は、整形式ではないようです。'
    ,"3_1_2_H58.1.XmlLang" : 'この要素の xml:lang 属性に指定されている言語は、整形式ではないようです。'


    //3_1_3.js
    ,"3_1_3_H40,H54,H60,G62,G70" : '慣用句や専門用語を含む、特殊または制限された用法の単語やフレーズの特定の定義を識別するためのメカニズムが利用可能であることを確認してください。'


    //3_1_4.js
    ,"3_1_4_G102,G55,G62,H28,G97" : '展開形式または略語の意味を識別するためのメカニズムが利用可能であることを確認してください。'


    //3_1_5.js
    ,"3_1_5_G86,G103,G79,G153,G160" : 'コンテンツが中等教育レベルよりも高度な読解力を必要とする場合は、補足的なコンテンツまたは代替バージョンを提供する必要があります。'


    //3_1_6.js
    ,"3_1_6_H62.1.HTML5" : 'ruby 要素が、本文の発音情報を含む rt 要素を含んでいません。'
    ,"3_1_6_H62.1.XHTML11" : 'ruby 要素が、 rb 要素内のテキストの発音情報を含む rt 要素を含んでいません。'
    ,"3_1_6_H62.2" : 'ruby 要素に rp 要素が含まれていません。これは、ルビテキストをサポートしていないブラウザに余分な句読点を提供します。'


    //3_2_1.js
    ,"3_2_1_G107" : 'この入力フィールドがフォーカスを受けたときにコンテキストの変更が起こらないことを確認してください。'


    //3_2_2.js
    ,"3_2_2_H32.2" : 'このフォームには送信ボタンがありません。キーボードを使用してフォームを送信できないユーザーに問題が発生します。送信ボタンは、 type 属性が "submit" または "image" の INPUT 要素、またはタイプが "submit" または省略/無効の BUTTON 要素です。'


    //3_2_3.js
    ,"3_2_3_G61" : '複数のウェブページ上で繰り返されているナビゲーションのメカニズムは、繰り返されるたびに相対的に同じ順序で出現することを確認してください。ただし、利用者が変更した場合を除きます。'


    //3_2_4.js
    ,"3_2_4_G197" : 'このウェブページ内で同じ機能を有するコンポーネントが、それが属するウェブページ一式の中で一貫して識別できることを確認してください。'


    //3_2_5.js
    ,"3_2_5_H83.3" : 'このリンクのリンクテキストに、リンクが新しいウィンドウで開くことを示す情報が含まれていることを確認してください。'


    //3_3_1.js
    ,"3_3_1_G83,G84,G85" : 'この形式で入力エラーが自動的に検出された場合は、エラーのある項目が識別され、エラーがテキストでユーザーに説明されていることを確認してください。'


    //3_3_2.js
    ,"3_3_2_G131,G89,G184,H90" : 'このフォームのユーザー入力に説明ラベルまたは説明（必須フィールドを含む）が指定されていることを確認してください。'


    //3_3_3.js
    ,"3_3_3_G177" : 'コンテンツのセキュリティや目的を損なうことがない限り、このフォームがユーザー入力の誤りに対する推奨される修正を提供することを確認してください。'


    //3_3_4.js
    ,"3_3_4_G98,G99,G155,G164,G168.LegalForms" : 'このフォームがユーザーに財務上または法律上のコミットメントを義務付ける場合、ユーザーが制御可能なデータを修正または削除する、またはテスト回答を送信する場合は、送信が可逆であるか、入力エラーのチェックを行っているか、またはユーザーによる確認を行っているかを確認してください。'


    //3_3_5.js
    ,"3_3_5_G71,G184,G193" : 'ウェブフォームやコントロールレベルで、このフォームの状況依存ヘルプが利用できることを確認してください。'


    //3_3_6.js
    ,"3_3_6_G98,G99,G155,G164,G168.AllForms" : 'このフォームへの送信が可逆であるか、入力エラーのチェックを行っているか、またはユーザーによる確認を行っているかを確認してください。'



    //4_1_1.js
    ,"4_1_1_F77" : 'ウェブページに重複したid属性値 "{{id}}" が見つかりました。'


    //4_1_2.js
    ,"4_1_2_H91.A.Empty" : 'アンカー要素がID付きで見つかりましたが href またはリンクテキストがありません。このIDを親または近くの要素に移動することを検討してください。'
    ,"4_1_2_H91.A.EmptyWithName" : 'name属性を持つアンカー要素が見つかりましたが、 href またはリンクテキストがありません。 name 属性を親または近くの要素のIDになるように移動することを検討してください。'
    ,"4_1_2_H91.A.EmptyNoId" : 'アンカー要素にリンクのコンテンツがなく、name または ID 属性もありません。'
    ,"4_1_2_H91.A.NoHref" : 'アンカー要素をページ内リンクの対象の定義に使用するべきではありません。このIDが別の目的(CSSやスクリプト等)で使用されていないなら、親要素へ移動することを検討してください。'
    ,"4_1_2_H91.A.Placeholder" : '有効なリンクのコンテンツをもつアンカー要素が見つかりましたが、 href 、 ID 、 name のいずれの属性も与えられていません。'
    ,"4_1_2_H91.A.NoContent" : '有効なhref属性をもつアンカー要素が見つかりましたが、リンクのコンテンツが与えられていません。'


    ,"4_1_2_input_element" : 'input 要素'
    ,"4_1_2_element_content" : '要素のコンテンツ'
    ,"4_1_2_element" : '要素'
    ,"4_1_2_msg_pattern" : 'この {{msgNodeType}} は、アクセシビリティAPIに名前を提供していません。有効な名前は: {{builtAttrs}}.'
    ,"4_1_2_msg_pattern_role_of_button" : 'この要素は "button" ロールをもっていますが、アクセシビリティAPIに名前を提供していません。有効な名前は: {{builtAttrs}}.'
    ,"4_1_2_msg_pattern2" : 'この {{msgNodeType}} は、アクセシビリティAPIに値を提供していません。'
    ,"4_1_2_msg_add_one" : '要素にコンテントを追加することで一つ追加します。'
    ,"4_1_2_msg_pattern3" : 'この {{msgNodeType}} は、初期の選択項目をもっていません。お使いのHTMLバージョンによっては、アクセシビリティAPIから見える値は未定義となるかもしれません。'
    ,"4_1_2_value_exposed_using_attribute" : '{{requiredValue}} 属性を使用することで値が露出します。'
    ,"4_1_2_value_exposed_using_element" : '{{requiredValue}} 要素を使用することで値が露出します。'

};
